# Exercises I

Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
2. cd into your exercises folder for this module and run echo env.py >> .gitignore
3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

4. Use your function to obtain a connection to the employees database.

In [43]:
import pandas as pd
import numpy as np
from sqlalchemy import text, create_engine
import datetime

from env import get_connection

In [2]:
url = get_connection('employees')
engine = create_engine(url)
employees = text('''
        SELECT * FROM employees
        ''')
e = pd.read_sql(employees,engine.connect())

In [3]:
e.head(3)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28

5. Once you have successfully run a query:

    a. Intentionally make a typo in the database url. What kind of error message do you see?

    b. Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
# a. URL created using funtion. No errors
# b. SQL syntax error

6. Read the employees and titles tables into two separate DataFrames.

In [5]:
titles = text('''
        SELECT * FROM titles
        ''')
t = pd.read_sql(titles,engine.connect())
t.head(3)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01

In [6]:
e.head(3)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [7]:
e.info() # 300,024 rows & 6 columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [8]:
t.info() # 443,308 rows & 4 columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

8. Display the summary statistics for each DataFrame.

In [9]:
e.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [10]:
t.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9. How many unique titles are in the titles DataFrame?

In [17]:
t['title'].nunique()

7

In [24]:
t['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10. What is the oldest date in the to_date column?

In [26]:
t.sort_values(by='to_date',ascending=True).head(3)

        emp_no     title   from_date     to_date
16064    20869  Engineer  1985-02-17  1985-03-01
406358  474918  Engineer  1985-02-10  1985-03-11
346216  434232     Staff  1985-02-26  1985-03-20

11. What is the most recent date in the to_date column?

In [48]:
#t['to_date'].dtype
dt = t['to_date'] != datetime.date(9999, 1, 1)
t[dt].sort_values(by='to_date',ascending=False).head(5)

        emp_no             title   from_date     to_date
154568  204324  Technique Leader  1985-02-10  2002-08-01
119478   90666          Engineer  1997-08-01  2002-08-01
387242  461960             Staff  1997-08-01  2002-08-01
319569  416185             Staff  1999-10-28  2002-08-01
67905    55876             Staff  1995-08-01  2002-08-01